#+TITLE: TF Probability vs ARCH: Stock Returns


Below we'll compare tensorflow probability with a traditional ARCH/GARCH model.


#+begin_src python :session :results output :exports both 
import tensorflow as tf
import keras
import tensorflow_probability as tfp
import json
import requests
import pandas as pd
import numpy as np
from pprint import pprint
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
#+end_src

#+RESULTS:
#+begin_example
Python 3.7.3 (default, Mar 26 2019, 21:43:19) 
[GCC 8.2.1 20181127] on linux
Type "help", "copyright", "credits" or "license" for more information.
python.el: native completion setup loaded
Using TensorFlow backend.
WARNING:tensorflow:From /home/matt/.local/lib/python3.7/site-packages/tensorflow_probability/python/distributions/deterministic.py:386: RegisterKL.__init__ (from tensorflow.python.ops.distributions.kullback_leibler) is deprecated and will be removed after 2019-01-01.
Instructions for updating:
The TensorFlow Distributions library has moved to TensorFlow Probability (https://github.com/tensorflow/probability). You should update all references to use `tfp.distributions` instead of `tf.distributions`.
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/home/matt/.local/lib/python3.7/site-packages/tensorflow_probability/__init__.py", line 21, in <module>
    from tensorflow_probability.python import *  # pylint: disable=wildcard-import
  File "/home/matt/.local/lib/python3.7/site-packages/tensorflow_probability/python/__init__.py", line 22, in <module>
    from tensorflow_probability.python import distributions
  File "/home/matt/.local/lib/python3.7/site-packages/tensorflow_probability/python/distributions/__init__.py", line 77, in <module>
    from tensorflow_probability.python.distributions.vector_diffeomixture import quadrature_scheme_softmaxnormal_gauss_hermite
  File "/home/matt/.local/lib/python3.7/site-packages/tensorflow_probability/python/distributions/vector_diffeomixture.py", line 28, in <module>
    from tensorflow.contrib.linalg.python.ops import linear_operator_addition as linop_add_lib
ModuleNotFoundError: No module named 'tensorflow.contrib.linalg'
#+end_example

** Get the data and convert into returns

#+begin_src python :session :results output :exports both

# %% function to import stock data from IEX

base_url = "https://api.iextrading.com/"
version = "1.0/"

def one_day(ticker):
    """Get 1 minute data for the last day"""
    tmp = pd.DataFrame.from_dict(requests.get(base_url + version + "/stock/" + ticker + "/chart/1d").json())
    tmp["Ticker"] = ticker
    return tmp

aapl = one_day("aapl")
spy = one_day("spy")

# %% convert minute closes to both numpy vectors and torch tensors
# %% numpy
aapl_numpy = aapl.close.values
spy_numpy = spy.close.values

## calculate returns
aapl_rets = np.diff(np.log(aapl_numpy))
spy_rets = np.diff(np.log(spy_numpy))

print(aapl_rets)
print(spy_rets)

#+end_src

#+RESULTS:
#+begin_example

... >>> >>> >>> >>> ... ... ... ... ... >>> >>> ... ... >>> >>> >>> ... >>> >>> >>> [ 2.85750288e-03  1.05070933e-03 -1.00020004e-04  0.00000000e+00
 -1.00030009e-04 -1.75214683e-03 -1.00215463e-04 -4.51093910e-04
  9.77113085e-04  7.51230140e-05  1.05113006e-03 -3.00210149e-04
 -3.50359122e-04 -9.01487515e-04  5.51005599e-04  5.00763665e-05
 -3.50587237e-04 -1.25310159e-03  7.52049370e-04  2.05272057e-03
 -5.00162553e-05  0.00000000e+00  5.00162553e-05 -4.00200105e-04
 -6.25633474e-04  5.75597198e-04  3.50201369e-04 -1.00045020e-04
 -8.75821138e-04 -1.17731061e-03  8.51810148e-04 -2.00360650e-04
 -4.00841773e-04 -6.01564085e-04 -2.00601806e-04 -5.01567398e-05
 -1.70682772e-03 -5.52833285e-04  1.00492421e-03  5.02083658e-04
  6.52332110e-04 -7.02529134e-04 -7.03023028e-04 -7.78923868e-04
 -8.29844263e-04  3.01841234e-04 -1.40937256e-03 -1.00745517e-04
 -4.03083595e-04 -8.06654947e-04 -1.81735625e-03  1.56514308e-03
 -3.78439070e-04 -7.57050029e-05 -6.31098005e-04  5.55387271e-04
 -2.52381854e-05  1.61396111e-03  1.00786132e-04  7.05218647e-04
 -1.66309727e-03 -5.04400898e-05  1.00877636e-04 -3.53116255e-04
 -6.05632400e-04  2.01918224e-04  4.54166990e-04  2.27006168e-04
 -1.26108176e-04 -1.31246864e-03 -3.53651455e-04  1.51580224e-04
 -6.57013644e-04 -5.05689012e-04 -1.01214584e-03 -3.03843624e-04
 -7.09327688e-04  4.05391715e-04 -5.06765328e-04 -7.60629838e-04
  1.52172259e-04 -1.01491940e-03  5.07704415e-05 -4.06235724e-04
  2.03138490e-04  1.26940605e-04  7.35937910e-04  7.61006050e-05
 -4.82068336e-04 -8.63229038e-04 -5.08013920e-05 -5.58985710e-04
  0.00000000e+00  2.54152212e-05 -2.54152212e-05 -8.89939924e-04
  3.81499808e-04 -4.06938304e-04  0.00000000e+00 -4.58003621e-04
  1.27244271e-04  6.35978602e-04  9.15099200e-04  0.00000000e+00
 -1.01636345e-04 -1.06780576e-03 -9.67093451e-04  7.63572538e-04
  3.56134419e-04  5.59383675e-04 -2.03376043e-04  1.32120554e-03
  3.55411138e-04 -2.28464088e-04  4.82251872e-04 -5.07524044e-05
  5.07524044e-05  4.05926533e-04  8.11359071e-04 -5.57738638e-04
  1.01430165e-04  1.01419878e-04  0.00000000e+00  7.09651287e-04
 -4.56146583e-04  1.01383890e-04  3.04090013e-04  3.29326530e-04
 -4.81359978e-04  5.06803842e-05 -3.54816640e-04  3.54816640e-04
  5.06662624e-04 -5.06547122e-05 -1.21648350e-03  4.56354748e-04
  6.08149218e-04 -2.02675315e-04  2.53337726e-04  5.06598445e-05
 -1.26654424e-04  1.26654424e-04 -2.53324891e-04  4.05289027e-04
  5.06380404e-04  3.54313774e-04  1.01209453e-04 -1.51818021e-04
  5.56553431e-04 -4.04735410e-04 -2.27735676e-04  7.59176547e-05
  3.03612997e-04  2.52940434e-04 -4.04735410e-04 -4.04899287e-04
  6.57878114e-04 -1.01183851e-04  3.03520844e-04 -2.02336993e-04
  2.02336993e-04 -2.02336993e-04  7.08000434e-04 -2.52799759e-04
  5.56075135e-04  2.52687968e-05 -5.81343932e-04 -3.03444093e-04
  1.51733556e-04  4.55062579e-04  1.51641520e-04 -4.04428497e-04
 -2.52822127e-05  1.51683689e-04 -4.04540978e-04 -2.27626239e-04
  0.00000000e+00 -4.55407978e-04  1.51825704e-04  5.56497118e-04
 -4.04694461e-04  2.02367703e-04 -1.01178732e-04 -3.03597634e-04
 -1.51833388e-04  2.02439395e-04  2.52991627e-04  2.02347229e-04
  5.05804102e-05  5.05663441e-04  5.05522837e-05  3.53794449e-04
  2.52633708e-04  5.05190836e-05 -5.55850339e-04 -3.53883879e-04
 -5.05650646e-05  2.52828519e-05 -5.05663431e-05 -2.52841304e-05
  2.52812541e-04  1.26382307e-04  4.04316080e-04 -1.51599374e-04
 -1.51622360e-04  1.51622360e-04 -1.26350370e-04 -1.51641520e-04
  5.05497283e-05 -3.53901771e-04 -2.02285831e-04  0.00000000e+00
  1.51718209e-04 -2.27585946e-04  7.58677373e-05  1.01148030e-04
  2.52825324e-04 -1.26404672e-04  2.52822127e-05 -1.51702865e-04
 -2.78181705e-04  2.78181705e-04 -5.05727362e-05  2.02275601e-04
  0.00000000e+00  5.05510070e-04 -1.01081573e-04 -1.51641520e-04
  2.02183583e-04  1.51610866e-04 -5.05344013e-05 -2.02163146e-04
 -1.51649185e-04 -1.76953121e-04  3.79146924e-04 -1.01091791e-04
  0.00000000e+00  0.00000000e+00 -1.01102012e-04  3.53812332e-04
 -5.05369552e-05 -2.27447909e-04  2.27447909e-04 -7.58102218e-05
  7.58102218e-05  0.00000000e+00 -3.03275376e-04  7.58274673e-05
 -2.27499653e-04  2.78048104e-04  1.01089237e-04  7.58102218e-05
 -5.05395093e-05  2.02142713e-04  6.31432742e-04  0.00000000e+00
  2.27218219e-04  8.57914312e-04  5.04426341e-05  3.02602383e-04
  5.54533324e-04 -1.00801371e-04  0.00000000e+00  2.01592582e-04
 -4.03225812e-04  5.04121191e-05  5.04095778e-05  1.51213489e-04
 -3.78076603e-04  2.77270151e-04  0.00000000e+00  1.00806452e-04
 -2.01623066e-04  7.56134139e-05  3.27592075e-04  2.51920898e-04
  6.04351348e-04  5.03461297e-05 -5.03461297e-05  7.80080312e-04
  2.51537523e-05 -5.03081374e-05 -1.76098414e-04  2.26406552e-04
 -5.03081374e-05  5.53250360e-04  3.01643962e-04  2.01045437e-04
 -7.53873023e-05 -5.02613591e-05 -2.51316269e-05  2.01035333e-04
 -1.00512614e-04  1.00512614e-04 -2.01035333e-04  1.50780288e-04
  4.01969657e-04 -1.50719687e-04  2.00954535e-04  0.00000000e+00
  2.51164777e-05 -1.75828593e-04 -1.50734833e-04 -3.01537845e-04
  5.02626222e-05 -4.02171733e-04  2.01106084e-04 -5.02727296e-05
  1.00542932e-04  3.01568157e-04 -6.03227284e-04  0.00000000e+00
  5.02828410e-05  1.00558098e-04 -2.51414206e-04 -4.02394251e-04
 -6.03895142e-04  1.51007979e-04 -1.00669452e-04 -5.03499331e-04
 -5.03638790e-05  3.02145233e-04 -1.00704935e-04  3.02084385e-04
  2.51667297e-04 -1.00659319e-04 -7.80453458e-04  5.79104419e-04
  1.76182626e-04  7.54973388e-05 -4.53069554e-04  1.00654261e-03
  3.01765329e-04 -5.02878982e-05  0.00000000e+00  0.00000000e+00
 -3.01780507e-04  3.52068405e-04 -5.53306017e-04 -1.50954789e-04
  5.03207951e-05  5.03068730e-04  3.01719805e-04 -5.02803128e-05
  0.00000000e+00 -1.50856109e-04  1.00573268e-04 -3.01750153e-04
 -5.03005458e-05 -6.03803983e-04  4.02576495e-04 -3.52245569e-04
  4.52864375e-04 -1.00618806e-04 -1.50947194e-04  2.51566000e-04
  3.01795687e-04  1.50863695e-04  4.02191952e-04 -1.75939075e-04
 -1.25689723e-04  1.50825771e-04  2.01065649e-04 -5.02626222e-05
  5.02626222e-05 -5.02626222e-05 -1.50803026e-04  4.02090878e-04
 -1.15644732e-03  2.51515381e-04  1.00588442e-04  4.27388037e-04
 -4.27388037e-04  2.76566057e-04  3.77012308e-04 -1.00522718e-04
  2.01035333e-04  5.02525189e-05 -6.78622172e-04 -4.77825150e-04
 -6.54236203e-04 -8.81379037e-04 -1.25974730e-04  0.00000000e+00
  1.15836935e-03  1.50992778e-04  2.51603977e-04 -2.01278117e-04
  6.54005809e-04]
[ 1.72458395e-04  8.62180455e-05 -1.20707345e-04 -2.06960782e-04
  1.72483679e-05  3.62147018e-04 -1.37945305e-04  5.68901776e-04
  4.65224479e-04 -1.03364515e-04  4.13393970e-04  1.03321796e-04
  2.06611571e-04 -2.92712326e-04  2.92712326e-04 -1.03300449e-04
 -3.27188507e-04 -3.10066839e-04 -1.20607517e-04  1.72292001e-04
  1.20586741e-04  1.55018732e-04  1.37774257e-04 -2.75567499e-04
  6.88989941e-05 -1.72243035e-05 -2.41171405e-04 -1.72287548e-05
  3.78964055e-04 -3.10050816e-04 -3.44560255e-05 -2.75690952e-04
 -1.03403705e-04 -1.37888242e-04  8.61823792e-05 -1.37895372e-04
 -1.89637190e-04 -3.44833532e-05  1.03446492e-04  3.79212277e-04
  0.00000000e+00 -2.41300265e-04 -2.06875152e-04 -1.55184454e-04
  1.20701101e-04 -5.17272594e-05 -5.17299353e-05  1.37940548e-04
 -6.89678955e-05  2.06889418e-04 -5.17183419e-05  1.89620845e-04
  1.20649092e-04  1.72343964e-05  1.37864479e-04 -1.89568560e-04
  4.30785674e-04 -1.37831226e-04 -2.06782466e-04  1.37859728e-04
 -1.37859728e-04 -3.79212277e-04  2.06860887e-04 -5.17232473e-04
 -6.89845475e-05 -2.06982200e-04 -2.07025051e-04 -1.38040515e-04
 -1.38059573e-04 -5.17893222e-04  6.90679283e-05 -2.07218098e-04
 -1.72714555e-04 -2.41850503e-04  1.38207450e-04  1.72732455e-04
  1.55433704e-04 -8.63490748e-05  2.07225255e-04 -3.79945776e-04
  1.72720521e-04  3.10821781e-04  3.10725201e-04  6.90369348e-05
 -1.38078636e-04  0.00000000e+00 -3.79814586e-04  1.03600104e-04
  3.45309829e-05 -1.03596526e-04 -2.07225255e-04 -6.90846287e-05
  3.45375427e-04 -1.72672803e-04 -3.45381387e-05 -1.89981089e-04
 -8.63669733e-05  1.20911674e-04 -8.63639897e-05 -1.03646634e-04
 -6.91037247e-05 -1.38221777e-04  8.63908495e-05  2.93673075e-04
 -1.72724996e-05 -2.59123301e-04 -1.72786178e-04  6.91180537e-05
  3.45572354e-05  1.72781699e-05  6.91096944e-05  3.28205840e-04
  8.63520574e-05  1.72695167e-05  6.90750846e-05  0.00000000e+00
  0.00000000e+00  3.45357531e-05 -6.90726990e-05 -6.90774704e-05
 -3.45405247e-05  0.00000000e+00 -3.45417178e-05  2.41766972e-04
 -1.72671312e-05 -2.59042752e-04 -3.45441042e-05  0.00000000e+00
 -1.38188351e-04 -3.45500717e-05 -1.72768266e-04  1.72768266e-04
  2.41825438e-04 -1.38178804e-04 -3.80090190e-04 -1.38250441e-04
  2.41925730e-04 -3.45572354e-05  6.91132767e-05  8.63848792e-05
  1.20926296e-04  1.03639473e-04  1.03628733e-04  1.03617995e-04
  2.76262175e-04  0.00000000e+00 -2.07189476e-04  1.03600104e-04
 -6.90655432e-05 -3.45345605e-05 -1.38150169e-04 -6.90822424e-05
 -1.38178804e-04  2.41800378e-04  0.00000000e+00 -1.03621574e-04
  5.18000530e-04 -1.72623620e-05  1.72610212e-04 -5.17799353e-05
 -3.45214465e-05 -3.45226382e-05  1.38083403e-04  6.90345518e-05
  4.48608459e-04  1.03496455e-04 -1.37997654e-04  1.03500026e-04
 -1.38002415e-04  1.03503597e-04 -1.03503597e-04 -3.45035797e-05
 -8.62641582e-05  2.07021479e-04  1.72498555e-05 -1.03503597e-04
 -5.17558161e-05  0.00000000e+00  0.00000000e+00  0.00000000e+00
 -3.45053656e-05  5.17576019e-05  3.45035797e-05 -5.17558161e-05
 -1.72538735e-04 -3.45113197e-05  5.17665329e-05  1.72535758e-04
  0.00000000e+00  3.45035797e-05  1.72513434e-05  5.17522448e-05
  1.37992894e-04 -6.89940665e-05  3.44976283e-05 -2.41508394e-04
 -1.38030988e-04  1.38030988e-04  1.72525340e-05  5.17558161e-05
 -3.45035797e-05  3.45035797e-05  2.75985788e-04  3.44928686e-05
  0.00000000e+00 -5.17397491e-05  1.72468805e-05  1.03475037e-04
  3.44892997e-05  1.72428658e-04  0.00000000e+00 -3.44833532e-05
  6.89655173e-05  3.44809751e-05 -6.89631392e-05  0.00000000e+00
  8.62031810e-05 -6.89619503e-05 -1.03451843e-04  3.44851369e-05
  5.17254757e-05 -6.89678955e-05  3.44845423e-05 -3.44845423e-05
  1.37931035e-04 -1.72403389e-05  8.61987226e-05  0.00000000e+00
  1.37902503e-04 -6.89488744e-05 -1.20671971e-04  3.44791918e-05
 -1.55165726e-04 -6.89702738e-05  6.89702738e-05 -6.89702738e-05
  6.89702738e-05 -6.89702738e-05 -8.62195322e-05  1.20705264e-04
 -2.06932230e-04  3.44916789e-05 -6.89845475e-05 -1.03485745e-04
  8.62388645e-05  1.72468805e-05  8.62299408e-05 -8.62299408e-05
  6.89845475e-05  1.72453933e-05 -2.58712132e-04  1.55235311e-04
 -8.62388645e-05  1.37978614e-04  0.00000000e+00 -6.89869270e-05
 -6.89916865e-05 -3.44976283e-05  3.44976283e-05 -3.44976283e-05
  3.44976283e-05             nan             nan -1.72483679e-05
 -3.44976283e-05 -6.89988270e-05  1.72501531e-05 -1.72501531e-05
 -6.90035882e-05  2.06996482e-04  2.41441753e-04  1.20699020e-04
 -1.72418252e-05  0.00000000e+00  1.03446492e-04 -3.44809751e-05
  3.44809751e-05 -6.89631392e-05  3.44821641e-05 -3.44821641e-05
  3.44821641e-05  6.89607614e-05 -3.44797862e-05  1.72387044e-04
 -6.89512515e-05  6.89512515e-05 -1.72373672e-05 -1.72376643e-05
 -3.44762200e-05 -1.37916767e-04  0.00000000e+00  3.44809751e-05
 -1.03446492e-04  6.89655173e-05 -3.44821641e-05 -1.37940548e-04
  3.44869208e-05 -6.89750311e-05  6.89750311e-05  1.37935791e-04
 -1.37935791e-04 -5.17308273e-05 -8.62239927e-05  3.44904893e-05
  1.55192482e-04 -1.03458979e-04 -1.20715672e-04 -3.44928686e-05
  1.72452447e-04  0.00000000e+00 -3.44881102e-05 -1.72445012e-05
 -8.62269667e-05 -1.03482175e-04 -3.44964382e-05 -6.89964467e-05
 -1.38007177e-04 -3.45047703e-05 -3.45059609e-05  3.45059609e-05
 -1.38030988e-04  3.45095333e-05  1.03521455e-04 -1.03521455e-04
  1.03521455e-04 -6.90131125e-05  0.00000000e+00 -8.62730889e-05
  1.72552132e-05  3.45095333e-05 -1.38045279e-04  1.03535746e-04
  3.45095333e-05  1.03521455e-04 -1.38030988e-04  6.90178757e-05
 -1.38040515e-04  2.76061978e-04  3.45023893e-05  3.45011989e-05
 -1.72504507e-05  5.17504593e-05  1.72482192e-04  0.00000000e+00
  0.00000000e+00  1.20719835e-04  1.72445012e-05 -3.44892997e-05
 -1.89712414e-04 -1.89748411e-04  6.90035882e-05 -1.38011938e-04
  1.38011938e-04  3.45000086e-05 -1.03503597e-04  0.00000000e+00
  2.06996482e-04  1.03482175e-04  1.20715672e-04 -1.55208540e-04
  1.55208540e-04  5.17308273e-05  2.06896552e-04  3.44785974e-05
 -1.20680292e-04 -1.55181779e-04  1.37940548e-04  3.79238425e-04
  0.00000000e+00 -1.03414399e-04 -1.03425094e-04  0.00000000e+00
  0.00000000e+00 -3.44774087e-05 -6.89583836e-05 -1.72416766e-04
  2.06896552e-04 -8.62016948e-05  1.89633921e-04 -4.31038205e-04
 -1.20723999e-04 -2.41491730e-04  2.75985788e-04 -1.03485745e-04
  4.65601540e-04  5.17201252e-05 -6.89607614e-05  2.75814516e-04
  3.10200426e-04]
#+end_example


*** Take a look at the data

#+begin_src python :session :results file :exports both
sns.distplot(aapl_rets)
plt.title("AAPL")
plt.show()
plt.savefig('test.png')
return 'test.png'
#+end_src

#+RESULTS:
[[file:Text(0.5, 1.0, 'AAPL')]]


#+begin_src python :session :results file :exports both
sns.scatterplot(x="spy_rets", y="aapl_rets")
plt.title("Scatter")
plt.show()
plt.savefig('test2.png')
return 'test2.png'
#+end_src

#+RESULTS:

** Create TF Probability Model
   

Model from here: https://www.youtube.com/watch?v=BrwKURU-wpk





#+begin_src python :session :results output :exports both 
model = tf.keras.Sequential([
    tf.keras.layers.Dense(100),
    tf.keras.layers.Dense(1),
    tfp.layers.DistributionLambda(lambda t:
       tfd.Normal(loc=t[...,0],
       scale=1)),
])
#+end_src

#+RESULTS:
: 
: ... ... ... ... ... Traceback (most recent call last):
:   File "<stdin>", line 4, in <module>
: AttributeError: module 'tensorflow_probability.python.layers' has no attribute 'DistributionLambda'
